## Day 25: Retail Data Processing and Analysis - Part 1

You are going to import the retail_shop_data CSV file 
below. You will preprocess and gain some insights into the 
data. 

1. Import the retail_shop_data file and view the first 5 rows. 
Write another code to check how many rows and columns 
are in the DataFrame. Are there any duplicates?

In [3]:
import pandas as pd 
import numpy as np

df = pd.read_csv("retail_shop_data.csv")
df.head(5)

,Date,Customer ID,Product ID,Product Name,Cost,Price,Quantity,Total
0,1 01 2023,1001,101,T-Shirt,18,20,2,40
1,1 01 2023,1002,102,Jeans,35,50,1,50
2,2 01 2023,1003,103,Hoodie,25,30,3,90
3,3 01 2023,1004,104,Sneakers,55,70,2,140
4,3 01 2023,1005,105,Sunglasses,17,25,1,25

In [4]:
# checking for number of rows 
df.shape[0]

21

In [5]:
# checking for number of columns
df.shape[1]

8

In [23]:
# checking for duplicate 
df.duplicated("Product Name").sum()

np.int64(1)

2. Create a copy of the DataFrame. Now, write another line 
of code to rename columns: "Total" to "Revenue," "Price" 
to "Price Per Product," and "Cost" to "Cost Per Product."

In [14]:
df2 = df.copy()
df2.rename(columns={'Total':'Revenue', 'Cost': 'Cost Per Product',
                    'Price': 'Price Per Product'}, inplace=True)

df2.head()

,Date,Customer ID,Product ID,Product Name,Cost Per Product,Price Per Product,Quantity,Revenue
0,1 01 2023,1001,101,T-Shirt,18,20,2,40
1,1 01 2023,1002,102,Jeans,35,50,1,50
2,2 01 2023,1003,103,Hoodie,25,30,3,90
3,3 01 2023,1004,104,Sneakers,55,70,2,140
4,3 01 2023,1005,105,Sunglasses,17,25,1,25

In [15]:
df2.head()

,Date,Customer ID,Product ID,Product Name,Cost Per Product,Price Per Product,Quantity,Revenue
0,1 01 2023,1001,101,T-Shirt,18,20,2,40
1,1 01 2023,1002,102,Jeans,35,50,1,50
2,2 01 2023,1003,103,Hoodie,25,30,3,90
3,3 01 2023,1004,104,Sneakers,55,70,2,140
4,3 01 2023,1005,105,Sunglasses,17,25,1,25

3. Calculate the total cost of each product and add this as a 
column to the DataFrame. Name this column: Costs. 
Calculate the difference between total revenue and total 
expenses. Name this column: Profit.

In [ ]:
# Calculating total cost
df2["Costs"] = df2["Cost Per Product"] * df2["Quantity"]
df2.head()

,Date,Customer ID,Product ID,Product Name,Cost Per Product,Price Per Product,Quantity,Revenue,Costs
0,1 01 2023,1001,101,T-Shirt,18,20,2,40,36
1,1 01 2023,1002,102,Jeans,35,50,1,50,35
2,2 01 2023,1003,103,Hoodie,25,30,3,90,75
3,3 01 2023,1004,104,Sneakers,55,70,2,140,110
4,3 01 2023,1005,105,Sunglasses,17,25,1,25,17

In [17]:
# Calculating total profit

df2["Profit"] = df2["Revenue"] - df2["Costs"]
df2.head()

,Date,Customer ID,Product ID,Product Name,Cost Per Product,Price Per Product,Quantity,Revenue,Costs,Profit
0,1 01 2023,1001,101,T-Shirt,18,20,2,40,36,4
1,1 01 2023,1002,102,Jeans,35,50,1,50,35,15
2,2 01 2023,1003,103,Hoodie,25,30,3,90,75,15
3,3 01 2023,1004,104,Sneakers,55,70,2,140,110,30
4,3 01 2023,1005,105,Sunglasses,17,25,1,25,17,8

4.  Add another column called "Filter." This column should 
check for all products that have a profit margin above $15. 
If a product has a profit margin of over $15, it should be 
given a value of True; otherwise, it should be False.

In [19]:
df2["Filter"] = df2["Profit"] > 15
df2.head()

,Date,Customer ID,Product ID,Product Name,Cost Per Product,Price Per Product,Quantity,Revenue,Costs,Profit,Filter
0,1 01 2023,1001,101,T-Shirt,18,20,2,40,36,4,False
1,1 01 2023,1002,102,Jeans,35,50,1,50,35,15,False
2,2 01 2023,1003,103,Hoodie,25,30,3,90,75,15,False
3,3 01 2023,1004,104,Sneakers,55,70,2,140,110,30,True
4,3 01 2023,1005,105,Sunglasses,17,25,1,25,17,8,False

5. Which products have a profit margin of over $15? Use 
pandas.

In [20]:
# Using filter to filter True values from DataFrame

over_50_margin = df2.query("Filter == True")["Product Name"] 
over_50_margin

3     Sneakers
7       Jacket
13      Jacket
Name: Product Name, dtype: object

In [ ]:
# we can also use the method below
df2[df2["Profit"] > 15]["Product Name"]

3     Sneakers
7       Jacket
13      Jacket
Name: Product Name, dtype: object